# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
# assigning links to names for easier use

url1 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
url2 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"
url3 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv"

In [2]:
#importing pandas 
import pandas as pd

In [3]:
df1 = pd.read_csv(url1)
df2 = pd.read_csv(url2)
df3 = pd.read_csv(url3)

In [4]:
#checking for column names before combining data to avoid mistakes 
for column in df2.columns:
    if column not in df1.columns:
        print(column)
    else: 
        print("all match")

all match
all match
all match
all match
all match
all match
all match
all match
all match
all match
all match

In [5]:
#just checking 
df1.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [6]:
#State & Gender does not match in column3 
for column in df3.columns:
    if column not in df1.columns:
        print(column)
    else: 
        print("match")

match
State
match
match
Gender
match
match
match
match
match
match

In [7]:
#Changed these names here to match all the names before merging, will edit again after merge 

df3.rename(columns={"State":"ST", "Gender":"GENDER"}, inplace = True)

In [8]:
df = pd.concat([df1, df2, df3])
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [9]:
##copy pasting cleaning steps from previous file##

#Renaming the ST and lowering the column names = replacing empty spaces with _ 

df.rename(columns={"ST":"state"}, inplace = True)
for column in df.columns: 
    df.rename(columns={column:column.lower().replace(" ", "_")}, inplace = True)

In [10]:
#correcting and unifying gender column : 

df['gender'] = df['gender'].replace({'Femal': 'F', 
                                     'female': 'F', 
                                     'Male': 'M'
                                    })
#fixing and unifing state names:

df['state'] = df['state'].replace({'AZ':'Arizona',
                                   'Cali':'California',
                                   'WA':'Washington'
                                  })
#fixing education column : 

df['education'] = df['education'].replace({'Bachelors' : 'Bachelor'})

#vehicle class as Luxury : 

df['vehicle_class'] = df['vehicle_class'].replace({'Sports Car': 'Luxury', 
                                                   'Luxury SUV': 'Luxury', 
                                                   'Luxury Car': 'Luxury'})
#replaced "%" with " "

df["customer_lifetime_value"] = df['customer_lifetime_value'].str.replace("%"," ")

In [11]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [12]:
#changing customer_lifetime_value to float 

df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)



def complaints_fix(current_number):
    """A function to fix the numeric values of open complaints by using split."""
    if pd.notna(current_number):
        if isinstance(current_number, int):
            return current_number  # Return the integer as it is
        else:
            return int((current_number.split("/")[1]))
    else:
        return None
        
df['number_of_open_complaints']= df['number_of_open_complaints'].apply(complaints_fix)

df['number_of_open_complaints'].unique()

array([ 0.,  2.,  1.,  3.,  5.,  4., nan])

In [13]:
# I have decided that filling non-numeric columns with previous one and filling numeric ones with the mean
#off the column is a better strategy to get cleaner results 

numeric_columns = df.select_dtypes(include=['float64']).columns.tolist()
object_columns = df.select_dtypes(include=['object']).columns.tolist()

for column in object_columns:
    df[column] = df[column].fillna(method="ffill")

for column in numeric_columns:
    df[column] = df[column].fillna(df[column].mean())

#now when checked, there's still one nan value in gender

df.loc[0, 'gender'] = "F"

In [14]:
#changing numberic values to int 
df[numeric_columns] = df[numeric_columns].astype(int)

In [15]:
# no duplicates 

df.drop_duplicates(inplace=True)
df.duplicated().sum()

0

In [16]:
df.describe().round(2)

,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount
count,9131.00,9131.00,9131.00,9131.00,9131.00
mean,780017.53,37828.38,110.41,0.38,430.09
std,300537.27,30361.00,581.57,0.91,289.65
min,200435.00,0.00,61.00,0.00,0.00
25%,779946.00,0.00,68.00,0.00,266.00
50%,779946.00,34244.00,83.00,0.00,377.00
75%,779946.00,62447.50,109.00,0.00,546.00
max,5816655.00,99981.00,35354.00,5.00,2893.00

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [17]:
#importing the data as pf df 
marketing_link = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv"
marketing_df = pd.read_csv(marketing_link)
marketing_df.sales_channel.unique()

array(['Agent', 'Call Center', 'Branch', 'Web'], dtype=object)

In [18]:
#checking if there're any null info, there's none 
marketing_df.isnull().sum()

unnamed:_0                       0
customer                         0
state                            0
customer_lifetime_value          0
response                         0
coverage                         0
education                        0
effective_to_date                0
employmentstatus                 0
gender                           0
income                           0
location_code                    0
marital_status                   0
monthly_premium_auto             0
months_since_last_claim          0
months_since_policy_inception    0
number_of_open_complaints        0
number_of_policies               0
policy_type                      0
policy                           0
renew_offer_type                 0
sales_channel                    0
total_claim_amount               0
vehicle_class                    0
vehicle_size                     0
vehicle_type                     0
month                            0
dtype: int64

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [19]:
import numpy as np

In [20]:
#grouping the data by salas channel and checking the sum of customer_lifetime_value by each group 

grouped_df = marketing_df.groupby("sales_channel")["customer_lifetime_value"].sum().round(2).reset_index()

#adding a new column to see the value as % of the total sales

grouped_df["%_of_total_sales"] = (grouped_df["customer_lifetime_value"]*100/marketing_df["customer_lifetime_value"].sum()).round(2)
grouped_df

  sales_channel  customer_lifetime_value  %_of_total_sales
0         Agent              33057887.85             37.79
1        Branch              24359201.21             27.85
2   Call Center              17364288.37             19.85
3           Web              12697632.90             14.52

In [21]:
#Agent sales chanlled is bringing the highest customer lifetime value together making over 65% with Branch.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [22]:
marketing_df.pivot_table(index='education',
                         columns='gender',
                         values='customer_lifetime_value',
                         aggfunc= 'mean'
                        ).round(1)

gender                     F       M
education
Bachelor              7874.3  7703.6
College               7748.8  8052.5
Doctor                7328.5  7415.3
High School or Below  8675.2  8149.7
Master                8157.1  8168.8

In [66]:
marketing_df.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [76]:
#using melted to create a long format 
melted_df = pd.melt(marketing_df, 
                    id_vars=['policy_type', 'month'],
                    value_vars=['number_of_open_complaints']
                    
).round(1)

In [77]:
melted_df

          policy_type  month                   variable  value
0      Corporate Auto      2  number_of_open_complaints    0.0
1       Personal Auto      1  number_of_open_complaints    0.0
2       Personal Auto      2  number_of_open_complaints    0.0
3      Corporate Auto      1  number_of_open_complaints    0.0
4       Personal Auto      1  number_of_open_complaints    0.4
...               ...    ...                        ...    ...
10905   Personal Auto      1  number_of_open_complaints    0.4
10906   Personal Auto      1  number_of_open_complaints    0.0
10907  Corporate Auto      2  number_of_open_complaints    0.0
10908   Personal Auto      2  number_of_open_complaints    4.0
10909   Personal Auto      1  number_of_open_complaints    0.0

[10910 rows x 4 columns]

In [79]:
#creating a pivot table that shows the total number of complaints per policy type and month 

melted_df.pivot_table(index='policy_type',
                      columns='month',
                      values='value',
                      aggfunc='sum'
).round(1)

month                1       2
policy_type
Corporate Auto   444.6   386.2
Personal Auto   1731.4  1457.4
Special Auto      87.2    95.4